# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4

   # elan-1 block
   [-1, 1, DRBNCSPELAN4, [128, 64, 32, 1, 13]],  # 2

   # avg-conv down
   [-1, 1, ADown, [256]],  # 3-P3/8

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [256, 128, 64, 1, 11]],  # 4

   # avg-conv down
   [-1, 1, ADown, [512]],  # 5-P4/16

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 9]],  # 6

   # avg-conv down
   [-1, 1, ADown, [1024]],  # 7-P5/32

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [1024, 512, 256, 1, 7]],  # 8
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, ASPPELAN, [1024, 512]],  # 9

   [[9, 6, 4], 1, FocusFeature, []], # 10-P4/16
   # up-concat merge
   [10, 1, ADown, [256]], # 11-P5/32
   [[-1, 9], 1, Concat, [1]],

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 5]],  # 12/13

   # up-concat merge
   [10, 1, DySample, [2, 'lp']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [256, 128, 64, 1, 5]],  # 15/16 (P3/8-small)
   [[13, 10, 16], 1, FocusFeature, []], # 17-P4/16

   # avg-conv-down merge
   [-1, 1, ADown, [256]], #18
   [[11, 18, 13], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 5]],  # 18/20 (P4/16-medium)

   # avg-conv-down merge
   [17, 1, DySample, [2, 'lp']],
   [[14, 21, 16], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [1024, 512, 256, 1, 5]],  # 21/23 (P5/32-large)

   # detect
   [[16, 20, 23], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
