# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [

   # conv down
   [-1, 1, SRFD, [128]],  # 1-P2/4 0

   # elan-1 block
   [-1, 1, DRBNCSPELAN4, [128, 64, 32, 1, 13]],  # 2/1

   # avg-conv down
   [-1, 1, DRFD, [256]],  # 3-P3/8 2

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [256, 128, 64, 1, 11]],  # 4/3

   # avg-conv down
   [-1, 1, DRFD, [512]],  # 5-P4/16 4

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 9]],  # 6/5

   # avg-conv down
   [-1, 1, DRFD, [1024]],  # 7-P5/32 6

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [1024, 512, 256, 1, 7]],  # 8/7
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, ASPPELAN, [1024, 512]],  # 9/8

   # up-concat merge
   [-1, 1, DySample, [2, 'lp']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 5]],  # 12/11

   # up-concat merge
   [-1, 1, DySample, [2, 'lp']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [256, 128, 64, 1, 5]],  # 15/14 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 11], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 5]],  # 18/17 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 8], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [1024, 512, 256, 1, 5]],  # 21/20 (P5/32-large)

   # detect
   [[14, 17, 20], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
