# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4

   # elan-1 block
   [-1, 1, DRBNCSPELAN4, [128, 64, 32, 1, 13]],  # 2
   [-1, 1, EMA_attention, [128]],  # 3

   # avg-conv down
   [-1, 1, ADown, [256]],  # 3-P3/8

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [256, 128, 64, 1, 11]],  # 4/5
   [-1, 1, EMA_attention, [256]],  # 6

   # avg-conv down
   [-1, 1, ADown, [512]],  # 5-P4/16

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 9]],  # 6/8
   [-1, 1, EMA_attention, [512]],  # 9

   # avg-conv down
   [-1, 1, ADown, [1024]],  # 7/10-P5/32

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [1024, 512, 256, 1, 7]],  # 8/11
   [-1, 1, EMA_attention, [1024]],  # 12
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, ASPPELAN, [1024, 512]],  # 9/13

   # up-concat merge
   [-1, 1, DySample, [2, 'lp']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 5]],  # 12/16

   # up-concat merge
   [-1, 1, DySample, [2, 'lp']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [256, 128, 64, 1, 5]],  # 15/19 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 16], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [512, 256, 128, 1, 5]],  # 18/22 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 13], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, DRBNCSPELAN4, [1024, 512, 256, 1, 5]],  # 21/25 (P5/32-large)

   # detect
   [[19, 22, 25], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
